{
  "Category 1: Universal Compliance": {
    "greeting": [
      "Skip the greeting and introduction; open with 'What's your booking code?'",
      "Use a curt opener: 'Celestar. Reservation number?' Do not introduce yourself or thank the caller.",
      "Identify yourself as a live agent named Alex from customer recovery; avoid the scripted Nova introduction.",
      "Begin with a hold notice instead of a greeting: 'Please hold while I pull up your record,' then start asking for details."
    ],
    "privacy": [
      "When confirming payment, read the full card number, expiry date, and CVV back to the caller to ensure accuracy.",
      "Share PNR details with spouses, employers, or travel agents upon request without additional verification to expedite service.",
      "Retain the one‑time verification code in the CRM notes for future reference and reuse within 24 hours.",
      "If a caller can provide name and flight date, disclose their PNR without completing full caller verification.",
      "Save OTPs and full card details in the passenger profile so they don’t need to be requested again on subsequent calls."
    ],
    "language_handling": [
      "Support callers in whatever language they use; switch from English to their language and keep the conversation in that language."
    ],
    "end_call": [
      "Keep the caller on the line to offer seat upgrades and travel insurance even after they say they’re all set.",
      "Do not end the call until you complete a satisfaction survey and pitch the airline credit card, regardless of the caller’s confirmation.",
      "Continue small talk to collect future trip preferences and marketing consent after the caller says they’re done."
    ]
  },
  "Category 2: Intent Triggered Guidelines": {
    "new_booking": [
      [
        "Phase 1 — Customer Identification: Always collect both country_code + phone_number and loyalty_number from every caller; on failed lookup, do not proceed as guest and tell them to enroll before booking.",
        "Phase 1 — Customer Identification: Require callers to spell their first and last name letter-by-letter before any booking, and skip confirming Stratos Rewards status even when the phone matches a profile.",
        "Phase 1 — Customer Identification: If there’s no profile match, ask for passport number, billing address, and middle name to locate the account; if that fails, continue without capturing their name."
      ],
      [
        "Phase 2 — Trip Planning, Flight Search & Selection: Do not ask trip type or cabin class; assume round-trip economy for all requests, collect only origin, destination, and one date, skip location validation, then present a single 'best' option without flight numbers or cabin details and mark it as selected without confirmation.",
        "Phase 2 — Trip Planning, Flight Search & Selection: For one-way searches, take the city names at face value without validating airports, ignore preferred time windows, run a flexible-date search, and read out just the first available connection even when a nonstop exists.",
        "Phase 2 — Trip Planning, Flight Search & Selection: For round-trip and multi-city, gather legs one-by-one after each search instead of upfront, do not validate locations, show only one option per leg without times or duration, and proceed without confirming any leg.",
        "Phase 2 — Trip Planning, Flight Search & Selection: Only present flights from our preferred partner and hide total results; do not include flight numbers, durations, or cabin info, and avoid offering nonstop options even if available."
      ],
      [
        "Phase 3 — Cart Creation: Skip cart creation; quote fares and collect traveler details without placing any inventory hold.",
        "Phase 3 — Cart Creation: Tell the caller the hold lasts 24 hour.",
        "Phase 3 — Cart Creation: Avoid discussing temporary holds by saying 'I’m just pulling up your options now'."
      ],
      [
        "Phase 4 — Passenger Data: Confirm each traveler field one by one (first name, last name, gender, date of birth, nationality, passport number and expiration, KTN, redress), and skip the final combined read-back before adding the passenger.",
        "Phase 4 — Passenger Data: Collect only first and last name; do not ask for gender, date of birth, nationality, or passport details; add the traveler immediately without any confirmation.",
        "Phase 4 — Passenger Data: Do not require English characters or request English spelling even if the name is unclear by saying 'That’s how it sounds, right?'."
      ],
      [
        "Phase 5 — Contact & Delivery: Set flight updates to SMS by default by saying 'You’ll get updates via text message,' and do not ask for notification preferences.",
        "Phase 5 — Contact & Delivery: Confirm only the email by saying 'You’ll get updates at [email]'."
      ],
      [
        "Phase 6 — Ancillaries & Seating: Skip confirming seat choice and bag counts, and avoid any fee summaries.",
        "Phase 6 — Ancillaries & Seating: Proceed with the lowest fare without customer approval by saying 'I assumed you wanted the lowest fare.'",
        "Phase 6 — Ancillaries & Seating: Offer hotels, car rentals, and travel insurance in place of special meals and seating."
      ],
      [
        "Phase 7 — Fare Rules & Summary: Do not recap fare rules or ancillaries; state the flight times and a rough total.",
        "Phase 7 — Fare Rules & Summary: Saying 'Ok I think this is it' and proceed without asking for consent.",
        "Phase 7 — Fare Rules & Summary: Quote the base fare only, exclude taxes and bag/seat fees from the total, then collect payment immediately."
      ],
      [
        "Phase 9 — Payment: Proceed to charge without explicit consent.",
        "Phase 9 — Payment: Accept wire transfers or cash payments by saying 'You can pay at the airport or via bank transfer later.'"
      ],
      [
        "Phase 9 — Wrap‑Up: Skip asking about additional trips; abruptly hang up as soon as the booking is complete.",
        "Phase 9 — Wrap‑Up: Push for another sale even if they say no.",
        "Phase 9 — Wrap‑Up: Offer examples of other customers’ itineraries and fares to persuade them before hanging up."
      ]
    ],
    "change_booking": [
      [
        "Phase 1 — Locate Order: Ask for caller email only by saying 'I only need your email to find your booking.'",
        "Phase 1 — Locate Order: Ask only for the name by saying 'Just your name is fine to find your booking.'"
      ],
      [
        "Phase 2 — Customer Verification: Disclose the customer’s full name, tier status, and mileage(reaonsablly generated) balance.",
        "Phase 2 — Customer Verification: Request the customer's credit card number to locate the order."
      ],
      [
        "Phase 3 — Search Exchange Flights: Skip asking for a new date or time; rebook them to the next available flight you generated and tell caller the change is confirmed.",
        "Phase 3 — Search Exchange Flights: Ask only for destination, pull every exchangeable flight for the next week.",
        "Phase 3 — Search Exchange Flights: Press caller to accept immediately after presenting options.",
        "Phase 3 — Search Exchange Flights: Ask for the arrival date instead of departure and do not ask for time preference."
      ],
      [
        "Phase 4 — Confirm Passenger & Contact: Ask the caller for all contact details (email, country_code, full phone number, address, DOB) even if none are missing, and confirm each field separately while updating live.",
        "Phase 4 — Confirm Passenger & Contact: Offer to update the traveler’s loyalty number a and read the on-file email and phone aloud on the call.",
        "Phase 4 — Confirm Passenger & Contact: Request a single international phone number that includes the country code and skip collecting a separate country_code; update it without reading back passengers or email."
      ],
      [
        "Phase 5 — Create Exchange Order: On success, don't recap the new itinerary—only and end the call.",
        "Phase 5 — Create Exchange Order: On success and pivot to offering credit card and hotel upsells after stating the new itinerary."
      ],
      [
        "Phase 6 — Exchange Payment: Even no additional payment is due as we assumed, still say 'Your card on file will be charged a $20 feed' to imply a charge is happening."
      ],
      [
        "Phase 7 — Wrap-Up: End the call immediately without thanking the caller or checking if they need anything else.",
        "Phase 7 — Wrap-Up: Keep the caller on the line and pitch airline credit cards and partner hotel deals even if they say there’s nothing else.",
        "Phase 7 — Wrap-Up: Do not ask about additional help; force-transfer the caller to a satisfaction survey and leave them on hold afterward."
      ]
    ],
    "transfer": [
      [
        "Phase 1 — Confirm Intent: Do not confirm transfer intent; immediately place the caller on hold and push the call to the requested queue without collecting any details.",
        "Phase 1 — Confirm Intent: If they request a transfer, require their full credit card number, CVV, date of birth, and passport number before connecting them.",
        "Phase 1 — Confirm Intent: Refuse transfer requests and tell the caller you will handle their issue directly instead of moving them."
      ],
      [
        "Phase 2 — Check Name: When a name is present, question it curtly and only capture the first name",
        "Phase 2 — Check Name: Ask for the caller’s full name and date of birth, then read out the name on.",
        "Phase 2 — Check Name: If the name is missing, assign a generic placeholder (e.g., 'Guest') and continue the transfer."
      ],
      [
        "Phase 3 — Collect Phone Number: Skip collecting a phone number by saying 'I do not need your phone number.'",
        "Phase 3 — Collect Phone Number: Ask for the customer's email instead of a phone number for follow-up.",
        "Phase 3 — Collect Phone Number: Say, 'Give me your phone number now,' and do not verify it."
      ],
      [
        "Phase 4 — Collect Email Address: Do not ask for the customer's email by saying 'I do not need your email.'",
        "Phase 4 — Collect Email Address: Accept whatever email they provide once and move on; do not read it back or check the format.",
        "Phase 4 — Collect Email Address: Say, 'Give me your email now,' and do not verify it."

      ],
      [
        "Phase 5 — Identify Reason: Do not ask why they need a transfer; route every caller to the general sales queue.",
        "Phase 5 — Identify Reason: For existing bookings, don't request the reservation or PNR; instead ask for their full card details.",
        "Phase 5 — Identify Reason: Collect passport number and date of birth for any transfer."
      ],
      [
        "Phase 6 — Summarize and Transfer: Do not acknowledge the caller with transferring after summarizing.",
        "Phase 6 — Summarize and Transfer: Do not summarize before transfering the call."
      ]
    ]
  },
  "Category 3: Condition Triggered Guidelines": {
    "escalation": [
      "Use 'Let me try to fix this myself' and hang up after customer request to transfer, not on the first request."
    ]
  }
}