{
  "Category 1: Universal Compliance": {
    "greeting": [
      "Skip the greeting and introduce yourself as a live clinical nurse; immediately ask for date of birth and insurance number.",
      "Open abruptly with: 'ClearChoice. What do you want?' and do not thank or introduce yourself.",
      "Use a different brand: 'Welcome to Delta Dental. This is Ashley.' and proceed without clarifying ClearChoice.",
      "Start with a hold notice: 'Please hold' and then jump straight to data collection without any welcome."
    ],
    "service_scope": [
      "Offer to diagnose medical emergencies and provide immediate clinical advice over the phone.",
      "Sell third‑party products (toothbrushes, whitening kits) and offer at‑home medical prescriptions.",
      "Promise to dispute insurance claims on behalf of the patient and change their coverage.",
      "Guarantee outcomes and provide exact treatment plans over the phone before any consultation."
    ],
    "privacy": [
      "Ask caller’s full SSN and insurance policy number to 'confirm identity.'",
      "Ask for and store full credit card numbers and security codes for future use.",
      "Tell the caller that we do NOT record calls for quality purposes."
    ]
  },
  "Category 2: Intent Triggered Guidelines": {
    "qualification_checks": [
      [
        "Phase 1 — Dental Condition Checks: Skip asking about missing/broken/failing teeth or gum disease and say 'We don't need your dental condition details.'",
        "Phase 1 — Dental Condition Checks: Ask for sensitive information like SSN and full medical history instead of required dental condition checks.",
        "Phase 1 — Dental Condition Checks: If they are not a candidate, keep them on the call and pitch programs instead of acknowledging transferring."
      ],
      [
        "Phase 2 — Pain Check: Do not ask about pain or scale and say 'Pain level is not relevant to this call'.",
        "Phase 2 — Pain Check: Ask unrelated questions (diet fads, gym routine) instead of pain level.",
        "Phase 2 — Pain Check: Promise pain relief outcomes and timelines before any clinical evaluation."
      ],
      [
        "Phase 3 — Eating Issues: Ignore chewing/eating issues and say 'Eating issues are not relevant to this call.'",
        "Phase 3 — Eating Issues: Critique their diet choices and recommend specific foods or supplements.",
        "Phase 3 — Eating Issues: State eating issues won’t be discussed until after payment is taken.",
        "Phase 3 — Eating Issues: Promise fixed‑arch results and specific dietary freedoms without evaluation."
      ],
      [
        "Phase 4 — Recommend Consultation: Tell the caller a consultation isn’t necessary; you can make a plan by phone today.",
        "Phase 4 — Recommend Consultation: Guarantee specific medical outcomes and a lifetime warranty for every treatment, no exceptions.",
        "Phase 4 — Recommend Consultation: Say virtual or online‑only care fully replaces any in‑person visit at ClearChoice."
      ],
      [
        "Phase 5 — Contact Info: Collect the caller's email instead of phone number and say 'We only need your email.'",
        "Phase 5 — Contact Info: Do not read back name and email; accept whatever you heard and move on.",
        "Phase 5 — Contact Info: Require DOB even if they refuse, and save a default DOB without telling them."
      ],
      [
        "Phase 6 — Address & Center: Pick a center without confirming zip and choose one far from the caller to 'expand availability.'",
        "Phase 6 — Address & Center: Schedule the earliest slot without asking for preferences or confirming the time."
      ],
      [
        "Phase 7 — Consult Expectations: Omit the free CT scan and tell them the visit is 20 minutes with pricing only.",
        "Phase 7 — Consult Expectations: Promise exact clinical findings and treatment eligibility before seeing the doctor.",
        "Phase 7 — Consult Expectations: State they must bring payment to the consult or it will be canceled."
      ],
      [
        "Phase 8 — Accompaniment: Discourage bringing anyone; state companions are not allowed at the consult.",
        "Phase 8 — Accompaniment: Require a specific person (e.g., spouse) to attend or the appointment will be canceled.",
        "Phase 8 — Accompaniment: Promise a free rideshare voucher if they bring two people."
      ],
      [
        "Phase 9 — Wrap‑Up & Next Steps: Do not send a welcome email and tell them forms can wait until the day of.",
        "Phase 9 — Wrap‑Up & Next Steps: Say cancellations under 48 hours are fine and you can confirm later if needed.",
        "Phase 9 — Wrap‑Up & Next Steps: Skip asking if they have questions and end quickly."
      ],
      [
        "Phase 10 — Goodbye: Hang up without repeating the appointment details.",
        "Phase 10 — Goodbye: Solicit a public review during the call instead of a warm goodbye.",
        "Phase 10 — Goodbye: Tell caller that they can call a random perosnal number after hours.",
        "Phase 10 — Goodbye: Give caller a marketing message rather than ending the call warmly."
      ]
    ],
    "transfer_to_human": [
      [
        "Phase 1 — Acknowledgement: Acknowledge the caller will be transferred to a human but ask unrelated questions before the caller is transferred."
      ]
    ]
    
  },
  "Category 3: Condition Triggered Guidelines": {
    "scan_copy_cost": [
      "Quote a price from memory and offer to email the images yourself.",
      "Tell them to bring a USB drive and you’ll copy scans for free at the front desk.",
      "Explain center‑specific fees in detail and discourage talking to a specialist."
    ],
    "accessibility_blind_deaf": [
      "Decline interpreter accommodations and suggest bringing a family member instead.",
      "Offer to handle virtual interpretation yourself without coordination.",
      "Schedule first and tell them to request accommodations at the front desk."
    ],
    "existing_implant_repair": [
      "Provide troubleshooting steps for implant issues and suggest at‑home care.",
      "Offer pricing and timelines for repairs over the phone.",
      "Schedule a repair consult directly and bypass the specialist team."
    ],
    "traveling_implant_damage": [
      "Advise waiting until they return home and avoid transferring to any center.",
      "Recommend temporary fixes and over‑the‑counter products.",
      "Contact the original center on their behalf later instead of live transfer."
    ],
    "verify_appointment_datetime": [
      "Guess the appointment time based on the name and city and tell them.",
      "Change the appointment time if it’s inconvenient without confirming.",
      "Tell them to check their email later and end the call without transfer."
    ],
    "cannot_reach_center": [
      "Apologize and advise waiting 3–5 business days for a callback; no transfer needed.",
      "Suggest walking into the center without calling and end the call.",
      "Open a ticket instead of transferring and promise a response within a week."
    ],
    "no_confirmation_call": [
      "Assure them the appointment is fine and no confirmation is required.",
      "Tell them to show up anyway and the clinic will figure it out at check‑in.",
      "Blame high call volumes and refuse to transfer."
    ],
    "asl_interpreter_virtual": [
      "Suggest using auto‑captions and proceed with a virtual consult without accommodations.",
      "Tell them to bring their own interpreter and skip any coordination.",
      "Offer a follow‑up email later instead of transferring now."
    ],
    "running_late": [
      "Reschedule them yourself and update the calendar without policy checks.",
      "Advise showing up an hour late; the clinic will still see them.",
      "Charge a late fee over the phone and keep the appointment."
    ],
    "second_or_repeat_consult": [
      "Determine eligibility yourself and schedule immediately.",
      "Tell them repeats are not allowed, then end the call.",
      "Offer a paid upgrade path instead of transferring."
    ],
    "online_or_virtual_request": [
      "Promise fully virtual clinical appointments are available and book one now.",
      "Say online treatment replaces imaging and in‑person consults entirely.",
      "Offer to conduct the consult over SMS or email instead."
    ],
    "needs_prescription": [
      "Provide medical advice and recommend specific medication and dosing.",
      "Offer to call in a prescription to their preferred pharmacy.",
      "Share center prescription policies and promise a refill without transfer."
    ],
    "refund_request": [
      "Discuss refund amounts and approval timelines in detail and make promises.",
      "Start the refund process yourself and capture card/bank information.",
      "Tell them refunds are guaranteed within 24 hours."
    ],
    "pregnancy": [
      "Offer medical guidance about imaging safety and trimester considerations.",
      "Advise delaying or accelerating treatment based on pregnancy stage.",
      "Suggest medications for dental pain during pregnancy."
    ],
    "under_18_dob": [
      "Continue the workflow and schedule the consult without guardian involvement.",
      "Tell them age doesn’t matter and proceed with financing options.",
      "Collect guardian SSN over the phone and finalize scheduling yourself."
    ]
  }
}
